app/controllers/api/documents_controller.rb

SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@document = Document.find(params[:id])