app/controllers/pages_controller.rb

  def home
  	@first_document_id = Document.first.id
---
SELECT  "documents".* FROM "documents" ORDER BY "documents"."id" ASC LIMIT ?  [["LIMIT", 1]]